// Переменные анализируют один класс в школе: у всех учеников фиксировнный возраст - 12 лет. Разное количество в классе мальчиков и девочек. Сумма двух значение дает общее количество учеников в классе...




// ========== ПЕРЕМЕННAЯ1 + перезапись переменной ==============
// let schoolchildren_boys = 12;
//     schoolchildren_boys = 14; // переопределние(перезапись) переменной (к примеру коректировка с учетом 2 отсутвующих в день анализа)


// ====================== ПЕРЕМЕННAЯ2  ========================
// let schoolchildren_girls = 15;



// ======= ПЕРЕМЕННAЯ3  -просто инициализация - значения двух перемнных -ответ на вопрос ДЗ ==============
// let schoolchildren_all; // просто инициализация
// let schoolchildren_boys = 12;
// let schoolchildren_girls = 15;
// schoolchildren_all = schoolchildren_boys + schoolchildren_girls;  // присвоение двух значений


//  Ответ на вопрос в ДЗ: "если вариант c = a = b; - в переменную с попадет занчение b"

// ====================== ПЕРЕМЕННAЯ4 - нельзя перезаписать ========================
// const schoolchildren_age = 12;





// ====================== ВЫВОД-ПЕРЕМЕННАЯ1 ========================
// console.log(schoolchildren_boys);

// ====================== ВЫВОД-ПЕРЕМЕННАЯ2 ========================
// console.log(schoolchildren_girls);

// ====================== ВЫВОД-ПЕРЕМЕННАЯ3 ========================
// console.log(schoolchildren_all);

// ====================== ВЫВОД-ПЕРЕМЕННАЯ4 ========================
// console.log(schoolchildren_age);
























